Tekla Open API Reference for Tekla Structures 2025
PointList.ToArray Method
 Copies the points to a point array.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Point[] ToArray()
Public Function ToArray As Point()
Return Value
Type: Point[]
The array of points.
See Also
Reference
PointList Class
Tekla.Structures.Drawing Namespace